tap "homebrew/bundle"
tap "homebrew/services"
brew "antidote"
brew "ast-grep"
brew "bat"
brew "bottom"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "glab"
brew "grep"
brew "grpcurl"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "less"
brew "libmemcached"
brew "luarocks"
brew "markdownlint-cli2"
brew "mise"
brew "neovim"
brew "pipx"
brew "postgresql@17", restart_service: :changed
brew "pyenv"
brew "ripgrep"
brew "starship"
brew "stow"
brew "trash"
brew "tree"
brew "uv"
brew "websocat"
brew "wget"
brew "yazi"
brew "zoxide"
cask "1password"
cask "1password-cli"
cask "dbeaver-community"
cask "eloston-chromium"
cask "firefox@developer-edition"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "keepingyouawake"
cask "obsidian"
cask "rectangle"
cask "slack"
cask "vscodium"
cask "zed"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
vscode "bierner.markdown-mermaid"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "pkief.material-icon-theme"
