tap "heroku/brew"

brew "antidote"
brew "bat"
brew "doctl"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "grep"
brew "heroku"
brew "less"
brew "libmemcached"
brew "mas"
brew "mise"
brew "postgres@16"
brew "pyenv"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tree"
brew "trash"
brew "yazi"
brew "zoxide"

cask "1password"
cask "1password-cli"
cask "dropbox"
cask "eloston-chromium"  # ungoogled-chromium
cask "firefox@developer-edition"
cask "keepingyouawake"
cask "rectangle"
cask "wezterm"
cask "vlc"
cask "vscodium"
cask "zed"

cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
