tap "heroku/brew"

brew "antidote"
brew "bat"
brew "bottom"
brew "doctl"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "grep"
brew "heroku"
brew "jq"
brew "lazygit"
brew "less"
brew "libmemcached"
brew "mas"
brew "mise"
brew "nvim"
brew "pipx"
brew "podman"
brew "postgres@16"
brew "pyenv"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tree"
brew "trash"
brew "uv"
brew "yazi"
brew "zoxide"

cask "1password"
cask "1password-cli"
cask "calibre"
cask "cleanshot"
cask "dropbox"
cask "elgato-control-center"
cask "elgato-stream-deck"
cask "elgato-wave-link"
cask "eloston-chromium"  # ungoogled-chromium
cask "firefox@developer-edition"
cask "keepingyouawake"
cask "logi-options+"
cask "obsidian"
cask "podman-desktop"
cask "raycast"
cask "rectangle"
cask "signal"
cask "wezterm"
cask "whatsapp"
cask "vscodium"
cask "zed"

cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"

mas 775737590 # IA Writer
mas 6714467650 # Perplexity.ai
